---
kind: method
id: M:Autodesk.Revit.DB.FabricationConnectorInfo.Dispose
source: html/65c20167-8861-44b5-af98-dd0093adce1f.htm
---
# Autodesk.Revit.DB.FabricationConnectorInfo.Dispose Method

Releases all resources used by the FabricationConnectorInfo

## Syntax (C#)
```csharp
public void Dispose()
```